app/controllers/listings_controller.rb

SELECT "listings".* FROM "listings"   ORDER BY created_at DESC
---
  def index
    @listings = Listing.all.order("created_at DESC")

INSERT INTO "listings" ("created_at", "description", "name", "price", "updated_at") VALUES (?, ?, ?, ?, ?)  [["created_at", "2014-05-25 20:03:37.704778"], ["description", "This is just a test"], ["name", "Test Listing"], ["price", 1.0], ["updated_at", "2014-05-25 20:03:37.704778"]]
UPDATE "users" SET "recipient" = ?, "updated_at" = ? WHERE "users"."id" = 4  [["recipient", "rp_1047EJ4dv6YZcdu4bTTYjcom"], ["updated_at", "2014-05-28 05:43:49.744322"]]
---
  def create
    @listing = Listing.new(listing_params)
    @listing.user_id = current_user.id

    if current_user.recipient.blank?
      Stripe.api_key = ENV["STRIPE_API_KEY"]
      token = params[:stripeToken]

      recipient = Stripe::Recipient.create(
        :name => current_user.name,
        :type => "individual",
        :bank_account => token
        )
    end

    current_user.recipient = recipient.id
    current_user.save

UPDATE "listings" SET "image_file_name" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "listings"."id" = 8  [["image_file_name", "pillow.jpeg"], ["image_file_size", 6338], ["image_updated_at", "2014-05-26 16:46:48.981920"], ["updated_at", "2014-05-26 16:46:49.161277"]]
---
  def update
    respond_to do |format|
      if @listing.update(listing_params)