app/controllers/orders_controller.rb

  def sales
    @orders = Order.all.where(seller: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders"  WHERE "orders"."seller_id" = 5  ORDER BY created_at_DESC

  def purchases
    @orders = Order.all.where(buyer: current_user).order("created_at DESC")
---
SELECT "orders".* FROM "orders"  WHERE "orders"."buyer_id" = 4  ORDER BY created_at DESC

  def new
    @order = Order.new
    @listing = Listing.find(params[:listing_id])
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 13]]

  def create
    @order = Order.new(order_params)
    @listing = Listing.find(params[:listing_id])
    @seller = @listing.user

    @order.listing_id = @listing.id
    @order.buyer_id = current_user.id
    @order.seller_id = @seller.id

    Stripe.api_key = ENV["STRIPE_API_KEY"]
    token = params[:stripeToken]

    begin
      charge = Stripe::Charge.create(
          :amount => (@listing.price * 100).floor,
          :currency => "usd",
          :card => token
          )
---
SELECT  "listings".* FROM "listings"  WHERE "listings"."id" = ? LIMIT 1  [["id", 13]]
INSERT INTO "orders" ("address", "buyer_id", "city", "created_at", "seller_id", "state", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)  [["address", "1 rainbow road"], ["buyer_id", 5], ["city", "San Fran"], ["created_at", "2014-05-27 02:48:02.104185"], ["seller_id", 4], ["state", "CA"], ["updated_at", "2014-05-27 02:48:02.104185"]]